Revit 2021.1 API
RevisionSettings.SetNumericRevisionSettings Method
 Replaces the current numeric revision numbering settings with the specified NumericRevisionSettings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2016
Syntax
C#
public void SetNumericRevisionSettings(
	NumericRevisionSettings newSettings
)
Visual Basic
Public Sub SetNumericRevisionSettings ( _
	newSettings As NumericRevisionSettings _
)
Visual C++
public:
void SetNumericRevisionSettings(
	NumericRevisionSettings^ newSettings
)
Parameters
newSettings
Type: Autodesk.Revit.DB.NumericRevisionSettings
 The specified NumericRevisionSettings to be applied to numeric revision numbering.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  newSettings is not a valid NumericRevisionSettings.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
RevisionSettings Class
Autodesk.Revit.DB Namespace